---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationSpring
source: html/c26b0df5-644b-235c-849d-fc1d340646a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationSpring Property

"Y Rotation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryYRotationSpring { get; }
```